#include <iostream> // Подключение библиотек

using namespace std; // Использую стандартное пространство имен

int main() {
	setlocale(LC_ALL, "RU"); // Устанавливаю русскую локализацию
	double a, b, c;
	double p; // Ввод 3 сторон треугольника и периметра
	cout << "Подсчет периметра треугольника." << endl;
	cout << "Введите 3 стороны треугольника: " << endl;
	cin >> a >> b >> c;
	// Проверка на существование данного треугольника
	if (a < 0 || b < 0 || c < 0 || (a + b <= c) || (a + c <= b) || (b + c <= a)) {
		cout << "Такого треугольника не существует" << endl;
	}
	else { // если треугольник существует, то выполняется данная программа
		p = a + b + c;
		// Вывод периметра треугольника
		cout << "Периметр треугольника: " << p;
	}
	

	return 0;
}
