#include <iostream> // Подключение библиотек

using namespace std;

int main() {
    setlocale(LC_ALL, "RU"); // Установка локализации
    double a, b;
    cout << "Подсчет общей длины двух отрезков в см и перевод в м.\n";
    cout << "Введите размеры двух отрезков в см: " << endl;
    cin >> a >> b; // Ввод 2 отрезков и проверка на их существование
    if (a <= 0 || b <= 0) {
        cout << "Ошибка. Введены неправильные данные";
    }
    else {
        int c = a + b;
        int g = c / 100;
        int f = c % 100;
        cout << "Длина отрезка в см: " << c << "cm" << endl; // Вывод в см
        cout << "Длина отрезка в метрах: " << g << "M " << f << "cm";
        // Вывод в м и см
    };



    return 0;
}
